using System;
using System.Numerics;

class productCalculator
{
    static void Main()
    {
        while (true)
        { //Програма за намиране на произведение(резултата от умножението, 'product' на анг.) на числа в интервала от "n" до "m". Напр., n=2, m =3 
          //резултата е 6, защото умножаваме 2х3=6; Друг пр., от n=2, до m=4 резултата от поизведението е 24, защото умножаване 2х3х4=24.
          //ДОПЪЛНИТЕЛНИ ФУКЦИИ-намиране логически на най-малката (MinValue) и най-голямата стойност (MaxValue) от два различни "int"-а.

            Console.Write("n=");
            int n = int.Parse(Console.ReadLine()); //Принципно трябва да се въведе по-малкото(от 'n') и после по-малкото (до 'm'). Но програмата ще извърши изчисленията и ако стойностите се обърнат(първо по-ГОЛЯМО,  
            Console.Write("m=");                   //после по-малко). Тъй като, програмата логически ще вземе по-малката и по-голямата когато се налага, посредством функцията "Math.Min(n, m)" и "Math.Max(n, m)".
            int m = int.Parse(Console.ReadLine());

            int num = Math.Min(n, m); //Тука програмата логически взема по-малката от двете стойности нужни за пресмятането.
            BigInteger product = 1;

            do
            {
                if (num != 0)       //Програмата може да извършва пресмятане и с отрицателни и положителни стойности едновременно. Тук се извършва проверка и когато стойностт на 'num' стане '0' програмата прескача пресмятането с нея за да не върне грешен резултат. 
                {                   //Напр., n=-2, m=3 резултата е 12, защото (-2)х(-1)х1х2х3=12, но реално м/у (-1)х1 седи 'х0', което както знаем ще приключи пресмятането с резултат, равно на '0', без значение от въведените стойности, защото всичко умножено 
                    product *= num; //по '0' е равно на '0' (n x 0 = 0). 
                }
                num++;
            } while (num <= Math.Max(n, m)); //Тук програмата логически взема по-ГОЛЯМАТА от двете стойности нужни за пресмятането.
            Console.WriteLine("The product is: {0}", product);
            Console.WriteLine("---------------");
        } //Програмата е направена в безкраен цъкъл, т.е. ще извършва пресмятане, след въвеждане на стойности (n, m), докато потребителя не затвори самата конзола!
    }
}
